'''
ORIGINAL
Какой метод сортировки непонятно
вроде пузырковый но половинчатый
Salīdzina
samaina
2, 5, 3, 6, 1, 4, 8, 7  
2, 5, 3, 6, 1, 4, 8, 7  
2, 3, 5, 6, 1, 4, 8, 7  
2, 3, 5, 6, 1, 4, 8, 7  
2, 3, 5, 6, 1, 4, 8, 7  
2, 3, 5, 1, 6, 4, 8, 7  
2, 3, 5, 1, 6, 4, 8, 7  
2, 3, 1, 5, 6, 4, 8, 7  
2, 3, 1, 5, 6, 4, 8, 7  
2, 1, 3, 5, 6, 4, 8, 7  
2, 1, 3, 5, 6, 4, 8, 7  
1, 2, 3, 5, 6, 4, 8, 7  
1, 2, 3, 5, 6, 4, 8, 7  
1, 2, 3, 5, 4, 6, 8, 7  
1, 2, 3, 5, 4, 6, 8, 7  
1, 2, 3, 4, 5, 6, 8, 7  
1, 2, 3, 4, 5, 6, 8, 7  
1, 2, 3, 4, 5, 6, 7, 8 

'''

'''
Sakartot augoši

Salidzinam
Mainam
[2 5 3 6 1 4 8 7]
[2 5 3 6 1 4 8 7]
[2 3 5 6 1 4 8 7] mainam
[2 3 5 6 1 4 8 7]
[2 3 5 6 1 4 8 7]
[2 3 5 1 6 4 8 7] mainam
[2 3 5 1 6 4 8 7]
[2 3 5 1 4 6 8 7] mainam

[2 3 5 1 4 6 8 7]
[2 3 5 1 4 6 8 7]
[2 3 5 1 4 6 7 8] mainam

[2 3 5 1 4 6 7 8]
[2 3 5 1 4 6 7 8]
[2 3 5 1 4 6 7 8]
[2 3 1 5 4 6 7 8] mainam

[2 3 1 5 4 6 7 8]
[2 3 1 4 5 6 7 8] mainam

[2 3 1 4 5 6 7 8]
[2 3 1 4 5 6 7 8]
[2 3 1 4 5 6 7 8]
[2 3 1 4 5 6 7 8]
[2 1 3 4 5 6 7 8]
[2 1 3 4 5 6 7 8]
[2 1 3 4 5 6 7 8]
[2 1 3 4 5 6 7 8]
[1 2 3 4 5 6 7 8]
[1 2 3 4 5 6 7 8]
[1 2 3 4 5 6 7 8]
[1 2 3 4 5 6 7 8]
[1 2 3 4 5 6 7 8]
[1 2 3 4 5 6 7 8]
[1 2 3 4 5 6 7 8]
[1 2 3 4 5 6 7 8]
[1 2 3 4 5 6 7 8]


Burbuļa kartošana uzlabotais

Salīdzina
Samaina

[2 5 3 6 1 4 8 7]
[2 5 3 6 1 4 8 7] vajag samainit
[2 3 5 6 1 4 8 7] samainam
[2 3 5 6 1 4 8 7] vajag samainit
[2 3 5 1 6 4 8 7] samainam
[2 3 5 1 4 6 8 7]
[2 3 5 1 4 6 8 7] vajag samainit
[2 3 5 1 4 6 7 8] samainam(8 ir sakartots)
[2 3 5 1 4 6 7 8]
[2 3 5 1 4 6 7 8] vajag samainit
[2 3 1 5 4 6 7 8] samainam
[2 3 1 4 5 6 7 8]
[2 3 1 4 5 6 7 8](7 ir sakartots)
[2 3 1 4 5 6 7 8]
[2 3 1 4 5 6 7 8] vajag samainit
[2 1 3 4 5 6 7 8] samainam
[2 1 3 4 5 6 7 8]
[2 1 3 4 5 6 7 8](6 ir sakarots)
[2 1 3 4 5 6 7 8] vajag samainit
[1 2 3 4 5 6 7 8] samainam
[1 2 3 4 5 6 7 8](1 ir sakartots)
[1 2 3 4 5 6 7 8](5 ir sakartots)
[1 2 3 4 5 6 7 8](2 ir sakartots)
[1 2 3 4 5 6 7 8](3 ir sakartots)
[1 2 3 4 5 6 7 8](4 ir sakartots)
Masīvs ir sakārtots
[1 2 3 4 5 6 7 8]
'''
